## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ses_active_receipt_rule_set.active has moved to aws_ses_active_receipt_rule_set.active[0]
    resource "aws_ses_active_receipt_rule_set" "active" {
        id            = "grants_ingest-staging-ffis_ingest"
        # (2 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.aws_s3_bucket_notification.default will be updated in-place
  ~ resource "aws_s3_bucket_notification" "default" {
        id          = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
        # (2 unchanged attributes hidden)

      ~ lambda_function {
          ~ filter_suffix       = "/grants.gov/extract.xml" -> "/ffis/raw.eml"
            id                  = "tf-s3-lambda-20230428182841935700000003"
          ~ lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB" -> "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload"
            # (2 unchanged attributes hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-28T18:49:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:22/invocations" -> (known after apply)
      ~ s3_key                         = "builds/8a8554fe1a436bfbd98abc1216ec92051f3f1adf1f3d5f3e29d2461fa647c8ce.zip" -> "builds/c58867400201112e24e5eeb58a32e1ac3d30739d12b046486798dc4d50c7d3d7.zip"
      ~ s3_object_version              = "XRjbdllsSdYpPYIn8na_wiEOCQFa9EVj" -> (known after apply)
        tags                           = {}
      ~ version                        = "22" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:9aa81e7732431f9f3e6c6d3275dffd6c15270260,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:571555245875d3f2fd72f2af7a46577aeac7260a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "9aa81e7732431f9f3e6c6d3275dffd6c15270260" -> "571555245875d3f2fd72f2af7a46577aeac7260a"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "22" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0479fbff6b1fd83b5a2b8150ce5f976f-2" -> (known after apply)
      ~ id                     = "builds/8a8554fe1a436bfbd98abc1216ec92051f3f1adf1f3d5f3e29d2461fa647c8ce.zip" -> (known after apply)
      ~ key                    = "builds/8a8554fe1a436bfbd98abc1216ec92051f3f1adf1f3d5f3e29d2461fa647c8ce.zip" -> "builds/c58867400201112e24e5eeb58a32e1ac3d30739d12b046486798dc4d50c7d3d7.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/8a8554fe1a436bfbd98abc1216ec92051f3f1adf1f3d5f3e29d2461fa647c8ce.zip" -> "builds/c58867400201112e24e5eeb58a32e1ac3d30739d12b046486798dc4d50c7d3d7.zip"
-       tags                   = {} -> null
      ~ version_id             = "XRjbdllsSdYpPYIn8na_wiEOCQFa9EVj" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/c58867400201112e24e5eeb58a32e1ac3d30739d12b046486798dc4d50c7d3d7.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/c58867400201112e24e5eeb58a32e1ac3d30739d12b046486798dc4d50c7d3d7.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2675759766685555617" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/8a8554fe1a436bfbd98abc1216ec92051f3f1adf1f3d5f3e29d2461fa647c8ce.zip" -> "builds/c58867400201112e24e5eeb58a32e1ac3d30739d12b046486798dc4d50c7d3d7.zip"
          ~ "timestamp" = "1682707744458579000" -> "1682712702753965000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "9199757201691106883" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/8a8554fe1a436bfbd98abc1216ec92051f3f1adf1f3d5f3e29d2461fa647c8ce.zip" -> "builds/c58867400201112e24e5eeb58a32e1ac3d30739d12b046486798dc4d50c7d3d7.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-04-28T18:49:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:2/invocations" -> (known after apply)
      ~ s3_key                         = "builds/c93d874241807609cdcda4160b2f8f333d2c6b961ce0719073f76a60512770c7.zip" -> "builds/f0dd61f2700613dd8983c06c4882d10d11e19005314f9f5844ec70b4b5452e6a.zip"
      ~ s3_object_version              = "w43Rql81zaXqKF6PlkjTdnVsycCuEB2q" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:9aa81e7732431f9f3e6c6d3275dffd6c15270260,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:571555245875d3f2fd72f2af7a46577aeac7260a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "9aa81e7732431f9f3e6c6d3275dffd6c15270260" -> "571555245875d3f2fd72f2af7a46577aeac7260a"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "caabd21bfbc5beb7b4202a60fde94bd2-2" -> (known after apply)
      ~ id                     = "builds/c93d874241807609cdcda4160b2f8f333d2c6b961ce0719073f76a60512770c7.zip" -> (known after apply)
      ~ key                    = "builds/c93d874241807609cdcda4160b2f8f333d2c6b961ce0719073f76a60512770c7.zip" -> "builds/f0dd61f2700613dd8983c06c4882d10d11e19005314f9f5844ec70b4b5452e6a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/c93d874241807609cdcda4160b2f8f333d2c6b961ce0719073f76a60512770c7.zip" -> "builds/f0dd61f2700613dd8983c06c4882d10d11e19005314f9f5844ec70b4b5452e6a.zip"
-       tags                   = {} -> null
      ~ version_id             = "w43Rql81zaXqKF6PlkjTdnVsycCuEB2q" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/f0dd61f2700613dd8983c06c4882d10d11e19005314f9f5844ec70b4b5452e6a.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f0dd61f2700613dd8983c06c4882d10d11e19005314f9f5844ec70b4b5452e6a.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5209231253445735808" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c93d874241807609cdcda4160b2f8f333d2c6b961ce0719073f76a60512770c7.zip" -> "builds/f0dd61f2700613dd8983c06c4882d10d11e19005314f9f5844ec70b4b5452e6a.zip"
          ~ "timestamp" = "1682707758952393000" -> "1682712717835252000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4673396838402896315" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/c93d874241807609cdcda4160b2f8f333d2c6b961ce0719073f76a60512770c7.zip" -> "builds/f0dd61f2700613dd8983c06c4882d10d11e19005314f9f5844ec70b4b5452e6a.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-28T18:49:36.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:21" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:21/invocations" -> (known after apply)
      ~ s3_key                         = "builds/2a63b199ba595a16a92867fa98583fbc17e04e8af6c06b7cd696793da205c1f4.zip" -> "builds/951b2ace24faad7b3e7e81441f06ab0376fd7839d06934d332d11f1a70887408.zip"
      ~ s3_object_version              = "6BlnceN.P6W6_6bSq4mdGuj_5DSpdIj4" -> (known after apply)
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:9aa81e7732431f9f3e6c6d3275dffd6c15270260,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:571555245875d3f2fd72f2af7a46577aeac7260a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "9aa81e7732431f9f3e6c6d3275dffd6c15270260" -> "571555245875d3f2fd72f2af7a46577aeac7260a"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "21" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "8f82cebc7a1e8ce76e74920f93f1fe8e-2" -> (known after apply)
      ~ id                     = "builds/2a63b199ba595a16a92867fa98583fbc17e04e8af6c06b7cd696793da205c1f4.zip" -> (known after apply)
      ~ key                    = "builds/2a63b199ba595a16a92867fa98583fbc17e04e8af6c06b7cd696793da205c1f4.zip" -> "builds/951b2ace24faad7b3e7e81441f06ab0376fd7839d06934d332d11f1a70887408.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/2a63b199ba595a16a92867fa98583fbc17e04e8af6c06b7cd696793da205c1f4.zip" -> "builds/951b2ace24faad7b3e7e81441f06ab0376fd7839d06934d332d11f1a70887408.zip"
-       tags                   = {} -> null
      ~ version_id             = "6BlnceN.P6W6_6bSq4mdGuj_5DSpdIj4" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/951b2ace24faad7b3e7e81441f06ab0376fd7839d06934d332d11f1a70887408.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/951b2ace24faad7b3e7e81441f06ab0376fd7839d06934d332d11f1a70887408.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3270381859957438924" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2a63b199ba595a16a92867fa98583fbc17e04e8af6c06b7cd696793da205c1f4.zip" -> "builds/951b2ace24faad7b3e7e81441f06ab0376fd7839d06934d332d11f1a70887408.zip"
          ~ "timestamp" = "1682707744506300000" -> "1682712702599798000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3462176224697726920" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/2a63b199ba595a16a92867fa98583fbc17e04e8af6c06b7cd696793da205c1f4.zip" -> "builds/951b2ace24faad7b3e7e81441f06ab0376fd7839d06934d332d11f1a70887408.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 15 to add, 8 to change, 12 to destroy.
```

</details>

*Pusher: @slapula, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4834390863)*